<?xml version="1.0" ?>
<net name="HTRModel16bit" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,1,1024,128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="batch_normalization/cond/FusedBatchNormV3_1/mean/Fused_Mul_66916693_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="16,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_6503/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="288" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="leaky_re_lu/LeakyRelu8120/Cast_19434_const" type="Const" version="opset1">
			<data element_type="f32" offset="320" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="leaky_re_lu/LeakyRelu8120" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1024</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="batch_normalization_1/cond/FusedBatchNormV3_1/mean/Fused_Mul_66956697_const" type="Const" version="opset1">
			<data element_type="f16" offset="324" shape="32,16,3,3" size="9216"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_65066511/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="9540" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2d_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="leaky_re_lu_1/LeakyRelu8124/Cast_19424_const" type="Const" version="opset1">
			<data element_type="f32" offset="320" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="leaky_re_lu_1/LeakyRelu8124" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="batch_normalization_2/cond/FusedBatchNormV3_1/mean/Fused_Mul_66996701_const" type="Const" version="opset1">
			<data element_type="f16" offset="9604" shape="48,32,3,3" size="27648"/>
			<output>
				<port id="1" precision="FP16">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_65146519/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="37252" shape="1,48,1,1" size="96"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2d_2/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="leaky_re_lu_2/LeakyRelu8128/Cast_19446_const" type="Const" version="opset1">
			<data element_type="f32" offset="320" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="leaky_re_lu_2/LeakyRelu8128" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="max_pooling2d_2/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="batch_normalization_3/cond/FusedBatchNormV3_1/mean/Fused_Mul_67036705_const" type="Const" version="opset1">
			<data element_type="f16" offset="37348" shape="64,48,3,3" size="55296"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_65226527/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="92644" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_3/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="leaky_re_lu_3/LeakyRelu8112/Cast_19438_const" type="Const" version="opset1">
			<data element_type="f32" offset="320" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="leaky_re_lu_3/LeakyRelu8112" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="batch_normalization_4/cond/FusedBatchNormV3_1/mean/Fused_Mul_67076709_const" type="Const" version="opset1">
			<data element_type="f16" offset="92772" shape="80,64,3,3" size="92160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_65306535/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="184932" shape="1,80,1,1" size="160"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv2d_4/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="leaky_re_lu_4/LeakyRelu8116/Cast_19422_const" type="Const" version="opset1">
			<data element_type="f32" offset="320" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="leaky_re_lu_4/LeakyRelu8116" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="leaky_re_lu_4/LeakyRelu/Transpose/Cast_19414_const" type="Const" version="opset1">
			<data element_type="i64" offset="185092" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="leaky_re_lu_4/LeakyRelu/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="reshape/Reshape/Cast_19466_const" type="Const" version="opset1">
			<data element_type="i64" offset="185124" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="bidirectional/forward_lstm_1/transpose/Cast_19428_const" type="Const" version="opset1">
			<data element_type="i64" offset="185148" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="bidirectional/forward_lstm_1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="bidirectional/forward_lstm_1/while/Enter_2/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="185172" shape="1,256" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bidirectional/forward_lstm_1/while/Enter_3/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="185172" shape="1,256" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="bidirectional/forward_lstm_1/while/LoopCond/TensorIteratorCondition_/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="2" internal_layer_id="16"/>
				<input external_port_id="1" internal_layer_id="7"/>
				<input axis="0" external_port_id="0" internal_layer_id="0"/>
				<output axis="0" external_port_id="3" internal_layer_id="29"/>
			</port_map>
			<back_edges>
				<edge from-layer="26" to-layer="7"/>
				<edge from-layer="22" to-layer="16"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="62" type="Parameter" version="opset1">
						<data element_type="f16" shape="1,1,1280"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="55_const" type="Const" version="opset1">
						<data element_type="i64" offset="286274" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="bidirectional/forward_lstm_1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1280</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="bidirectional/forward_lstm_1/while/mul/Enter/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f16" offset="286282" shape="1,1280" size="2560"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="bidirectional/forward_lstm_1/while/mul" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="bidirectional/forward_lstm_1/while/MatMul/1_port_transpose401_const" type="Const" version="opset1">
						<data element_type="f16" offset="288842" shape="1024,1280" size="2621440"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1024</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="bidirectional/forward_lstm_1/while/MatMul" type="MatMul" version="opset1">
						<data transpose_a="False" transpose_b="True"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
							<port id="1">
								<dim>1024</dim>
								<dim>1280</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="64" type="Parameter" version="opset1">
						<data element_type="f16" shape="1,256"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="bidirectional/forward_lstm_1/while/MatMul_1/1_port_transpose405_const" type="Const" version="opset1">
						<data element_type="f16" offset="2910282" shape="1024,256" size="524288"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="bidirectional/forward_lstm_1/while/MatMul_1" type="MatMul" version="opset1">
						<data transpose_a="False" transpose_b="True"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="bidirectional/forward_lstm_1/while/add" type="Add" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="bidirectional/forward_lstm_1/while/BiasAdd/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f16" offset="3434570" shape="1024" size="2048"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="bidirectional/forward_lstm_1/while/BiasAdd/Add" type="Add" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
							<port id="1">
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="13" name="bidirectional/forward_lstm_1/while/split/split_dim/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="i64" offset="3436618" shape="" size="8"/>
						<output>
							<port id="1" precision="I64"/>
						</output>
					</layer>
					<layer id="14" name="bidirectional/forward_lstm_1/while/split" type="Split" version="opset1">
						<data num_splits="4"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
							<port id="1"/>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="3" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="4" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="5" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="15" name="bidirectional/forward_lstm_1/while/Sigmoid_1" type="Sigmoid" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="16" name="66" type="Parameter" version="opset1">
						<data element_type="f16" shape="1,256"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="bidirectional/forward_lstm_1/while/mul_1" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="bidirectional/forward_lstm_1/while/Sigmoid" type="Sigmoid" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="19" name="bidirectional/forward_lstm_1/while/Tanh" type="Tanh" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="bidirectional/forward_lstm_1/while/mul_2" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="bidirectional/forward_lstm_1/while/add_1" type="Add" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="22" name="bidirectional/forward_lstm_1/while/add_1/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="23" name="bidirectional/forward_lstm_1/while/Sigmoid_2" type="Sigmoid" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="bidirectional/forward_lstm_1/while/Tanh_1" type="Tanh" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="bidirectional/forward_lstm_1/while/mul_3" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="bidirectional/forward_lstm_1/while/mul_3/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="27" name="58_const" type="Const" version="opset1">
						<data element_type="i64" offset="286274" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="28" name="bidirectional/forward_lstm_1/while/mul_3/Output_0/Data_/OutputUnsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="60/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
					<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
					<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
					<edge from-layer="5" from-port="1" to-layer="6" to-port="1"/>
					<edge from-layer="7" from-port="0" to-layer="9" to-port="0"/>
					<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
					<edge from-layer="6" from-port="2" to-layer="10" to-port="0"/>
					<edge from-layer="9" from-port="2" to-layer="10" to-port="1"/>
					<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
					<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
					<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
					<edge from-layer="13" from-port="1" to-layer="14" to-port="1"/>
					<edge from-layer="14" from-port="3" to-layer="15" to-port="0"/>
					<edge from-layer="15" from-port="1" to-layer="17" to-port="0"/>
					<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
					<edge from-layer="14" from-port="2" to-layer="18" to-port="0"/>
					<edge from-layer="14" from-port="4" to-layer="19" to-port="0"/>
					<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
					<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
					<edge from-layer="17" from-port="2" to-layer="21" to-port="0"/>
					<edge from-layer="20" from-port="2" to-layer="21" to-port="1"/>
					<edge from-layer="21" from-port="2" to-layer="22" to-port="0"/>
					<edge from-layer="14" from-port="5" to-layer="23" to-port="0"/>
					<edge from-layer="21" from-port="2" to-layer="24" to-port="0"/>
					<edge from-layer="23" from-port="1" to-layer="25" to-port="0"/>
					<edge from-layer="24" from-port="1" to-layer="25" to-port="1"/>
					<edge from-layer="25" from-port="2" to-layer="26" to-port="0"/>
					<edge from-layer="25" from-port="2" to-layer="28" to-port="0"/>
					<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
					<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="43" name="bidirectional/forward_lstm_1/transpose_1/Cast_19454_const" type="Const" version="opset1">
			<data element_type="i64" offset="185148" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="bidirectional/forward_lstm_1/transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="bidirectional/backward_lstm_1/transpose/Cast_19432_const" type="Const" version="opset1">
			<data element_type="i64" offset="185148" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="bidirectional/backward_lstm_1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="35163518_const" type="Const" version="opset1">
			<data element_type="f16" offset="185684" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bidirectional/backward_lstm_1/ReverseV2/ReverseSequence/" type="ReverseSequence" version="opset1">
			<data batch_axis="1" seq_axis="0"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="bidirectional/backward_lstm_1/while/Enter_2/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="185172" shape="1,256" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="bidirectional/backward_lstm_1/while/Enter_3/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="185172" shape="1,256" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="bidirectional/backward_lstm_1/while/LoopCond/TensorIteratorCondition_/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="2" internal_layer_id="16"/>
				<input external_port_id="1" internal_layer_id="7"/>
				<input axis="0" external_port_id="0" internal_layer_id="0"/>
				<output axis="0" external_port_id="3" internal_layer_id="29"/>
			</port_map>
			<back_edges>
				<edge from-layer="26" to-layer="7"/>
				<edge from-layer="22" to-layer="16"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="62" type="Parameter" version="opset1">
						<data element_type="f16" shape="1,1,1280"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="55_const" type="Const" version="opset1">
						<data element_type="i64" offset="286274" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="bidirectional/backward_lstm_1/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>1280</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="bidirectional/backward_lstm_1/while/mul/Enter/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f16" offset="286282" shape="1,1280" size="2560"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="bidirectional/backward_lstm_1/while/mul" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="bidirectional/backward_lstm_1/while/MatMul/1_port_transpose405_const" type="Const" version="opset1">
						<data element_type="f16" offset="3436626" shape="1024,1280" size="2621440"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1024</dim>
								<dim>1280</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="bidirectional/backward_lstm_1/while/MatMul" type="MatMul" version="opset1">
						<data transpose_a="False" transpose_b="True"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1280</dim>
							</port>
							<port id="1">
								<dim>1024</dim>
								<dim>1280</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="64" type="Parameter" version="opset1">
						<data element_type="f16" shape="1,256"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="bidirectional/backward_lstm_1/while/MatMul_1/1_port_transpose401_const" type="Const" version="opset1">
						<data element_type="f16" offset="6058066" shape="1024,256" size="524288"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="bidirectional/backward_lstm_1/while/MatMul_1" type="MatMul" version="opset1">
						<data transpose_a="False" transpose_b="True"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="bidirectional/backward_lstm_1/while/add" type="Add" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="bidirectional/backward_lstm_1/while/BiasAdd/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f16" offset="6582354" shape="1024" size="2048"/>
						<output>
							<port id="1" precision="FP16">
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="bidirectional/backward_lstm_1/while/BiasAdd/Add" type="Add" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
							<port id="1">
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="13" name="bidirectional/backward_lstm_1/while/split/split_dim/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="i64" offset="3436618" shape="" size="8"/>
						<output>
							<port id="1" precision="I64"/>
						</output>
					</layer>
					<layer id="14" name="bidirectional/backward_lstm_1/while/split" type="Split" version="opset1">
						<data num_splits="4"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1024</dim>
							</port>
							<port id="1"/>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="3" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="4" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="5" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="15" name="bidirectional/backward_lstm_1/while/Sigmoid_1" type="Sigmoid" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="16" name="66" type="Parameter" version="opset1">
						<data element_type="f16" shape="1,256"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="17" name="bidirectional/backward_lstm_1/while/mul_1" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="18" name="bidirectional/backward_lstm_1/while/Sigmoid" type="Sigmoid" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="19" name="bidirectional/backward_lstm_1/while/Tanh" type="Tanh" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="20" name="bidirectional/backward_lstm_1/while/mul_2" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="21" name="bidirectional/backward_lstm_1/while/add_1" type="Add" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="22" name="bidirectional/backward_lstm_1/while/add_1/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="23" name="bidirectional/backward_lstm_1/while/Sigmoid_2" type="Sigmoid" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="24" name="bidirectional/backward_lstm_1/while/Tanh_1" type="Tanh" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="1" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="25" name="bidirectional/backward_lstm_1/while/mul_3" type="Multiply" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="26" name="bidirectional/backward_lstm_1/while/mul_3/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="27" name="58_const" type="Const" version="opset1">
						<data element_type="i64" offset="286274" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="28" name="bidirectional/backward_lstm_1/while/mul_3/Output_0/Data_/OutputUnsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="29" name="60/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
					<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
					<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
					<edge from-layer="5" from-port="1" to-layer="6" to-port="1"/>
					<edge from-layer="7" from-port="0" to-layer="9" to-port="0"/>
					<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
					<edge from-layer="6" from-port="2" to-layer="10" to-port="0"/>
					<edge from-layer="9" from-port="2" to-layer="10" to-port="1"/>
					<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
					<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
					<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
					<edge from-layer="13" from-port="1" to-layer="14" to-port="1"/>
					<edge from-layer="14" from-port="3" to-layer="15" to-port="0"/>
					<edge from-layer="15" from-port="1" to-layer="17" to-port="0"/>
					<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
					<edge from-layer="14" from-port="2" to-layer="18" to-port="0"/>
					<edge from-layer="14" from-port="4" to-layer="19" to-port="0"/>
					<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
					<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
					<edge from-layer="17" from-port="2" to-layer="21" to-port="0"/>
					<edge from-layer="20" from-port="2" to-layer="21" to-port="1"/>
					<edge from-layer="21" from-port="2" to-layer="22" to-port="0"/>
					<edge from-layer="14" from-port="5" to-layer="23" to-port="0"/>
					<edge from-layer="21" from-port="2" to-layer="24" to-port="0"/>
					<edge from-layer="23" from-port="1" to-layer="25" to-port="0"/>
					<edge from-layer="24" from-port="1" to-layer="25" to-port="1"/>
					<edge from-layer="25" from-port="2" to-layer="26" to-port="0"/>
					<edge from-layer="25" from-port="2" to-layer="28" to-port="0"/>
					<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
					<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="52" name="bidirectional/backward_lstm_1/transpose_1/Cast_19440_const" type="Const" version="opset1">
			<data element_type="i64" offset="185148" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="bidirectional/backward_lstm_1/transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="35203522_const" type="Const" version="opset1">
			<data element_type="f16" offset="185684" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="bidirectional/ReverseV2/ReverseSequence/" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="bidirectional/concat" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="bidirectional_1/forward_lstm_1_1/transpose/Cast_19444_const" type="Const" version="opset1">
			<data element_type="i64" offset="185148" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="bidirectional_1/forward_lstm_1_1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
